chronoweb/src/main/resources/webroot/example/poll/SimpleEventQuery_sensor/EQ_deviceID.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:query="urn:epcglobal:epcis-query:xsd:2"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<soapenv:Header />
	<soapenv:Body>
		<query:Poll>
			<queryName>SimpleEventQuery</queryName>
			<params>
				<param>
					<name>EQ_deviceID</name>
					<value xsi:type="query:ArrayOfString">
						<string>urn:epc:id:giai:4000001.111</string>
					</value>
				</param>
				<param>
					<name>EQ_SENSORMETADATA_deviceID</name>
					<value xsi:type="query:ArrayOfString">
						<string>urn:epc:id:giai:4000001.111</string>
					</value>
				</param>
				<param>
					<name>EQ_SENSORREPORT_deviceID</name>
					<value xsi:type="query:ArrayOfString">
						<string>urn:epc:id:giai:4000001.112</string>
					</value>
				</param>
			</params>
		</query:Poll>
	</soapenv:Body>
</soapenv:Envelope>